{
  "asin": "B0D1KJ6PKJ",
  "details": {
    "title": "COSMIQ Lavender Oak Candle, 20oz Jar Candles for Home Scented, 110 Hours Burning Time, 100% Natural Soy Candles, Relaxing Aromatherapy Scented Candle, Chic Home Decor, Housewarming Gifts for Women",
    "brand": "COSMIQ CANDLE",
    "price": 19.0,
    "currency": "USD",
    "size": null,
    "color": "Lavender Oak",
    "material": null,
    "item_weight": "1.75 Pounds",
    "manufacturer": "COSMIQ CANDLE",
    "personal_flotation_device_type": null,
    "features": [
      "LAVENDER OAK – HIGHLY SCENTED CANDLES : A tranquil blend of fresh lavender and grounded oakwood creates a soothing, spa-like aroma. Lavender Candle ideal for relaxation, meditation, winding down after a long day or your everyday relaxation aromatherapy candle.",
      "20oz LARGE JAR – LONG BURNING CANDLES : Our premium soy wax candles offers up to 110 hours of burn time, making it a reliable choice for those seeking long lasting candle that keep rooms filled with fragrance.",
      "100% NATURAL & NON TOXIC CANDLES – SAFE & CLEAN : Made with 100% soy wax and a cotton wick, these soy candles non toxic are free from paraffin and harmful chemicals. A healthier option among organic candles and ideal for daily use.",
      "ECO FRIENDLY MATERIALS – REUSABLE JAR & LID : More than just a candles for women, this stylish jar candle design doubles as home decor. Once finished, the reusable glass jar with wooden lid can be repurposed for storage or display.",
      "PERFECT GIFT – FOR WOMEN & MEN : These highly scented candles are thoughtful candles for gifts, perfect for women/men/friends/teacher/family members! For any occasion: Happy Birthday, Mother's day, Father's Day, Anniversary Gift, Friendship, Thanksgiving Day, Valentine's Day."
    ]
  },
  "rating": {
    "average_rating": 4.4,
    "out_of": 5.0,
    "total_ratings": 36,
    "star_distribution": {
      "5": 74,
      "4": 10,
      "3": 3,
      "2": 7,
      "1": 6
    },
    "star_counts": {
      "5": 27,
      "4": 4,
      "3": 1,
      "2": 3,
      "1": 2
    },
    "reviews_last_30d": null
  },
  "reviews": [
    {
      "review_id": "R3Y2147GL6EWJ",
      "reviewer_name": "Cyn",
      "rating": 5.0,
      "title": "5.0 out of 5 stars Lavender is great",
      "date": "September 3, 2025",
      "verified_purchase": true,
      "review_text": "Probably one of my favorite scented candles of all time. I have a sensitive nose, so it's not overpowering at all, and still allows the fragrance to permeate the room really nicely. The color is a really pretty purple, so even in the evening light, I know which candle I'm lighting. It's lasted a long time, and I've still got wax to burn haha. Great size for the price, and works really well! Read more",
      "helpful_count": 0
    },
    {
      "review_id": "R3RSS447MALDWZ",
      "reviewer_name": "Oksana",
      "rating": 5.0,
      "title": "5.0 out of 5 stars Will definitely buy again!",
      "date": "June 5, 2025",
      "verified_purchase": true,
      "review_text": "Absolutely love this candle! The “Fresh Linen” scent is clean, calming, and not overpowering — perfect for creating a cozy atmosphere. The design is beautiful and elegant, and the natural soy wax burns cleanly. Great quality and makes a lovely gift too. Will definitely buy again! Read more",
      "helpful_count": 2
    },
    {
      "review_id": "R2R7VDXYPR8PXH",
      "reviewer_name": "Lindsey Nelson",
      "rating": 5.0,
      "title": "5.0 out of 5 stars Clean lavender & oak candle! Highly recommended!",
      "date": "June 1, 2025",
      "verified_purchase": true,
      "review_text": "The media could not be loaded. I recently purchased this Lavender Oak Scent candle and it has quickly become a staple in my relaxation routine. The calming & earthy fragrance—a tranquil blend of fresh lavender and grounded oakwood—fills the room with a soothing, spa-like aroma that helps me unwind after a long day.The candle burns cleanly with no sooty residue, and the wax pools evenly, which means no wasted wax around the edges. It’s also a good value for the money, especially considering the quality.I love the aesthetically pleasing jar—it fits seamlessly into my home décor and makes a great gift, too.Even better, it’s made from 100% natural soy wax with a cotton wick, so it’s completely eco-friendly. There are no harsh additives—free from paraffin, phthalates, and other chemicals—which gives me peace of mind when burning it in my home.Highly recommend if you’re looking for a natural, beautifully scented candle that delivers on both performance and presentation. Read more",
      "helpful_count": 0
    },
    {
      "review_id": "R1A48GPEN9OPF",
      "reviewer_name": "JimEOD",
      "rating": 5.0,
      "title": "5.0 out of 5 stars Nice double wick candle",
      "date": "May 18, 2025",
      "verified_purchase": true,
      "review_text": "Smells great! Strong enough to scent the whole house. Read more",
      "helpful_count": 0
    },
    {
      "review_id": "R2S1BP2VHEIZ88",
      "reviewer_name": "Tamylu",
      "rating": 4.0,
      "title": "4.0 out of 5 stars Candle itself is nice but I do not like scent",
      "date": "September 26, 2025",
      "verified_purchase": false,
      "review_text": "This candle looks nice, very nice jar and color wax. The candle is a nice size and would make a good gift. The burn time is very good and the wicks burn atrong. The candle looks very luxurious, now the smell I do not like. In my opinion smells nothing like fresh linen. To me this product smells like a cologne instead and not a good smelling one similar to the ones that give you a headache after a while is the best way to explain it. Maybe I chose the wrong scent but this scent is a no for me. I would recommend these shoes candle but in a different scent. Read more",
      "helpful_count": 0
    },
    {
      "review_id": "RJ56A6JCEA4X3",
      "reviewer_name": "Jing Gao",
      "rating": 5.0,
      "title": "5.0 out of 5 stars smell",
      "date": "April 19, 2025",
      "verified_purchase": true,
      "review_text": "I like it. Ugh, this candle is EVERYTHING. My room smells like a cozy dream and I’m obsessed. Read more",
      "helpful_count": 0
    },
    {
      "review_id": "R2GSX6UBSCKZIK",
      "reviewer_name": "Will",
      "rating": 2.0,
      "title": "2.0 out of 5 stars Ugly spots and imperfections in the glass jar",
      "date": "September 24, 2025",
      "verified_purchase": false,
      "review_text": "There several large spots and imperfections in the glass jar that really stand out. It looks like the inside of the glass had adhesive or was dirty before they poured the candle. It is inside the jar, so it cannot be cleaned off. It is all around all sides of the candle making it not very attractive. Because of this I would not give it as a gift and don't love having it as a decoration in my home.It does come nicely packaged, secure with Styrofoam inside a box. The candle has 2 wicks and the smell is a nice subtle scent of spice. The candle is a nice size and has a nice wood lid. If it weren't for the ugly spots all around the glass then this would be a nice candle. Read more",
      "helpful_count": 0
    },
    {
      "review_id": "ROIRXYDNAZEDJ",
      "reviewer_name": "Deborah Petri",
      "rating": 5.0,
      "title": "5.0 out of 5 stars Most Highly Scented Candle I’ve Ever Burned",
      "date": "September 26, 2025",
      "verified_purchase": false,
      "review_text": "Wow. I was having one of those awful, stressful days, and the minute I lit this candle it was like the tension just melted away. Honestly, I could smell the lavender oak before I even took it out of the box, and once lit, it filled the entire room with the most relaxing, spa-like scent. Within minutes I felt myself sink into a puddle of calm.This is hands-down the most highly scented candle I’ve ever burned. I only had it lit for about an hour before I had to get back to real life, but the fragrance lingered for hours. At one point I was in the pantry—which is behind a bathroom that’s behind my office, with all the doors shut, and I could still smell it! That’s how strong and long-lasting the scent throw is.On top of that, it’s a clean-burning soy candle in a chic jar with a wooden lid, so it doubles as décor and can be reused later. If you’re looking for a candle that truly delivers on relaxation and fragrance power, this one is amazing. Read more",
      "helpful_count": 0
    }
  ],
  "images": {
    "urls": [
      "https://m.media-amazon.com/images/I/7159Yeg8LzL._AC_SL1500_.jpg"
    ],
    "video_present": false
  },
  "catalog": {
    "category_path": [
      "Health & Household",
      "Health Care",
      "Alternative Medicine",
      "Aromatherapy",
      "Candles"
    ],
    "product_type": "AROMATHERAPY",
    "parent_asin": null,
    "variation_dimensions": {}
  },
  "a_plus": {
    "text": "Cosmiq Candle Collection Cosmiq Candle Collection Cosmiq Candle Collection"
  },
  "offer": {
    "is_fba": null,
    "is_prime": true,
    "buybox_price": 19.0,
    "buybox_seller": null,
    "has_coupon": true,
    "promo_badges": [
      "coupon"
    ],
    "availability": "in_stock"
  },
  "inventory": {
    "on_hand": null,
    "inbound": null,
    "reserved": null,
    "available_to_sell": null,
    "avg_daily_units_30d": null,
    "buffer_days": null,
    "in_stock": null
  },
  "store": {
    "brand_store_url": "https://www.amazon.com/stores/COSMIQCANDLE/page/5D66F907-45D2-4AF1-BAD5-9AD8519C93E6?is_byline_deeplink=true&deeplink=FB00AF30-BE47-478B-9F40-831B149CEF0E&redirect_store_id=5D66F907-45D2-4AF1-BAD5-9AD8519C93E6&lp_asin=B0D1KJ6PKJ&ref_=ast_bln",
    "sections_ok": null,
    "follow_cta_present": true
  },
  "kg": {
    "wikidata_qid": null,
    "wikipedia_url": null,
    "categories": [],
    "products": [],
    "regional_variants": {}
  },
  "site": {
    "sku_url": null,
    "static_html_ok": null,
    "has_spec_table": null,
    "has_comparison_tables": null,
    "has_structured_specs": null,
    "has_cite_snippets": null,
    "last_updated_visible": null
  },
  "metadata": {
    "marketplace": "IN",
    "language": "en",
    "url": "https://www.amazon.com/dp/B0D1KJ6PKJ",
    
    "source": "html_scrape",
    "content_sha256": "31753422572242de099454c3f8310df03ab9b714e5859ad545a1ebcacbb715fb",
    "collected_at_utc": "2025-09-30T20:52:19.368686Z"
  },
  "scraped_at": "2025-10-01T02:22:19.368721"
}